info = [['male', 'female'], [18, 21, 32, 45], ['小美', '大壮', '丧彪', '佛伯乐']]

useraccount = [['国内成人，有头像昵称','海外儿童，未设置头像昵称'],
               [17111111122, 17111111123, 17111111124],
               ['qaz12345']]

user = [['一站点成人', '有头像无昵称', 17111111122, 'qaz12345'],
        ['五站点成人', '有头像有昵称-新加坡成人', 17111111123, 'qaz12345'],
        ['七站点成人', '无头像无昵称', 17111111124, 'qaz12345'],
        ['八站点成人', '无头像有昵称-俄罗斯成人', 17111111125, 'qaz12345']
        ]

test_dic = {
  "menu": {
    "id": "file",
    "popup": {
      "menuitem": [
        {
          "no1": "username"
        },
        {
          "no2": "password"
        },
        {
          "no3": "age"
        }
      ]
    },
    "value": "file"
  }
}

user1 = {
    "17111111122": "qaz12345",
    "17111111123": "qaz12345",
    "17111111124": "qaz12345"
}

user2 = {
    "有头像有昵称-中国成人1": {
        " ": "qaz12345"
    }
}